app/views/gossips/show.html.erb

<html>
  <body>
  <div class="card-body">
    <h1>Voici le contenu du potin n°<%=params['id']%> : </h1>
    <p>
      <p><strong>Le titre :</strong> <%= Gossip.find(params['id']).title%></p>
      <p><strong>Le contenu :</strong> <%= Gossip.find(params['id']).content%></p>
      <p><strong>L'auteur :</strong> <%= User.find(params['id']).first_name%> <%= User.find(params['id']).last_name%></p>
      <p><strong>Sa ville : </strong> <%= City.find(params['id']).name%></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]


    <% Comment.all.each  do |comment| %>
---
SELECT "comments".* FROM "comments"