app/views/city/show.html.erb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---

  <p><strong>Le nom de la ville :</strong> <%= City.find(params['id']).name%></p>