app/views/user/new.html.erb

SELECT "cities".* FROM "cities"
---
                                    <div class="col-md-6">
                                    <p style = "width: 200px"><%= select_tag(:city_id, options_from_collection_for_select(City.all, "id", "name"))%></p>