app/views/user/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
---

    <p><strong>Son prénom :</strong> <%= User.find(params['id']).first_name%></p>
    <p><strong>Son nom : </strong><%= User.find(params['id']).last_name%></p>
    <p><strong>Sa description : </strong><%= User.find(params['id']).description%></p>
    <p><strong>Son âge :</strong> <%= User.find(params['id']).age%></p>
    <p><strong>Son email :</strong> <%= User.find(params['id']).email%></p>
    <p><strong>Sa ville :</strong> <%= City.find(params['id']).name%></p>