app/controllers/city_controller.rb

  def show
  @city = City.find(params['id'])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]