app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "anonymous"], ["LIMIT", 1]]
---
  def create
    @comment = Comment.new(content: params[:content], user_id: User.find_by(first_name: 'anonymous').id)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @comment = Comment.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "A little more than kin, and less than kind !"], ["updated_at", "2022-02-16 16:37:20.460264"], ["id", 2]]
---
  def update
    @comment = Comment.find(params[:id])
    comment_params = params.require(:comment).permit(:content)
    @comment.update(comment_params)