app/controllers/gossips_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "anonymous"], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["content", "test"], ["created_at", "2022-02-16 12:01:25.062316"], ["updated_at", "2022-02-16 12:01:25.062316"], ["user_id", 42]]
---
  def create
    @gossip = Gossip.new(title: params[:title],content: params[:content], user_id: User.find_by(first_name: 'anonymous').id)
      if @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
---
  def show
    @gossip = Gossip.find(params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
---
  def edit
    @gossip = Gossip.find(params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "Blabla"], ["updated_at", "2022-02-16 12:07:10.734766"], ["id", 1]]
---
  def update
    @gossip = Gossip.find(params[:id])
    gossip_params = params.require(:gossip).permit(:title, :content)
    @gossip.update(post_params)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 22]]
---
  def destroy
    @gossip = Gossip.find(params[:id])
    @gossip.destroy