app/controllers/pages_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def home
    render file: './app/views/home.html.erb'
    @gossip = Gossip.all