app/views/home.html.erb

SELECT "gossips".* FROM "gossips"
---
  <% index = 0 %>
   <% Gossip.all.each do |gossip|%>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
      <strong><%= gossip.title %><br/></strong>
      <footer class="blockquote-footer"><%= User.all.find_by(id: gossip.user_id).first_name%>, le <cite title="Source Creation"><%= gossip.created_at%></cite></footer>