app/views/welcome.html.erb

        <center>
          <h2 class="display- fw-normal" style="color: blue;">Bienvenue <%= User.find_by(id: session[:user_id]).first_name %> <%= params['first_name']%> ! Ici c'est notre super site de potins, il est chouette, non ?</h2></center>
---
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "anonymous"], ["LIMIT", 1]]